# GROUPBY CONCAT MERGE JOIN

In [2]:
import pandas as pd

In [8]:
df = pd.DataFrame({
    'Company': ['MSFT', 'APPL', 'MSFT', 'APPL'],
    'B': ['one', 'one', 'two', 'three'],
    'C': [1, 2, 3, 4],
    'D': [10, 20, 30, 40]
})

In [9]:
df

  Company      B  C   D
0    MSFT    one  1  10
1    APPL    one  2  20
2    MSFT    two  3  30
3    APPL  three  4  40

In [12]:
grouped = df.groupby('Company').sum()
grouped

                B  C   D
Company
APPL     onethree  6  60
MSFT       onetwo  4  40

In [24]:
df= df.drop('B', axis=1)

In [25]:
group_df = df.groupby("Company").mean()

In [31]:
# group_df = df.groupby("Company").agg('mean', 'sum')
# group_df

In [32]:
df1 = pd.DataFrame({'A': ['A0', 'A1'],
                    'B': ['B0', 'B1']})
df2 = pd.DataFrame({'A': ['A2', 'A3'], 
                    'B': ['B2',' B3']})

In [33]:
df1

    A   B
0  A0  B0
1  A1  B1

In [34]:
df2

    A    B
0  A2   B2
1  A3   B3

In [35]:
result = pd.concat([df1,df2])
result

    A    B
0  A0   B0
1  A1   B1
0  A2   B2
1  A3   B3

In [36]:
concat_df = pd.concat([df1,df2],axis=1)
concat_df

    A   B   A    B
0  A0  B0  A2   B2
1  A1  B1  A3   B3